import kidsBanner from '@/images/aboutGroup/kids.jpg';
import basicBanner from '@/images/aboutGroup/basic.png';
import beginnersBanner from '@/images/aboutGroup/beginners.png';
import eventsBanner from '@/images/aboutGroup/events.png';
import proBanner from '@/images/aboutGroup/pro.png';
import personalBanner from '@/images/aboutGroup/personal.png';

import { IAboutGroup } from '@/types/aboutGroups';
import Belt from '@/icons/aboutGroup/belt.svg?react';
import {
  LuBaby,
  LuTimer,
  LuUser,
  LuUsers,
  LuCalendar,
  LuTrophy,
} from 'react-icons/lu';

const kids: IAboutGroup = {
  title: 'дитячі групи',
  banner: kidsBanner,
  text: 'Тренування для маленьких самураїв та амазонок !',
  about: [
    {
      text: 'Від 6 років',
      icon: LuBaby,
    },
    {
      text: 'Білий, сірий пояси',
      icon: Belt,
    },
    {
      text: 'Тренування 60 хв',
      icon: LuTimer,
    },
  ],
  goals: [
    'Програма побудована для гармонійного фізичного та ментального розвитку вашої малечі.',
    'Головне завдання груп привчити дітей до активного способу життя, взаємодії в колективі та навичкам самозахисту в ігровій формі.',
  ],
  levels: ['Базовий', 'Середній'],
};

const basic: IAboutGroup = {
  title: 'базова група',
  banner: basicBanner,
  text: 'Основа, фундамент, грунт!',
  about: [
    {
      text: 'Від початківця і до майстра',
      icon: LuTrophy,
    },
    {
      text: 'Техніки для всіх рівнів',
      icon: Belt,
    },
    {
      text: 'Тренування 90 хв',
      icon: LuTimer,
    },
  ],
  goals: [
    'Групи де ви поглиблено вивчаєте головні позиції, базові техніки та формуєте своє повноцінне джиу-джитсу.',
    'Робота над комбінаціями, переходами та системністю в діях.',
    'Підготовка до перших змагань та адаптація до інтенсивних навантажень.',
  ],
  features: [
    'Значно більше боротьби',
    'Періодичні цикли підготовки до змагань',
  ],
  levels: null,
  note: 'До базових груп допускаються студенти, які закінчили курс початківців та будь-які відвідувачі з досвідом від 6 місяців в джиу джитсу, або з досвідом у суміжних видах боротьби.',
};

const beginners: IAboutGroup = {
  title: 'початківці',
  banner: beginnersBanner,
  text: 'Групи розраховані на людей з будь-яким рівнем підготовки, або її відсутності!',
  about: [
    {
      text: 'Курс триває 3 місяці',
      icon: LuUser,
    },
    {
      text: 'Будь який рівень',
      icon: Belt,
    },
    {
      text: 'Тренування 60 хв',
      icon: LuTimer,
    },
  ],
  goals: [
    'Формати в кімоно та без нього (Гі - Ноугі).',
    'Плавно прогресуючі навантаження в зручному для тебе темпі.',
    'Вивчення простих та ефективних технік за прогресивною авторською програмою тренувань.',
    'Дружня атмосфера.',
    'Після закінчення курсу ви зможете повноцінно доєднатись до базових груп.',
  ],
  levels: null,
  requirements: [
    'Зручний спортивний одяг без металевих деталей',
    'Пляшка води',
    'Капці та рушник для душа',
    'Згодом доведеться придбати кімоно, або компресійний одяг для Ноу Гі',
  ],
  note: 'Можна приєднатись у будь-який момент. З приводу актуального набору в групи початківців запитуйте у нас в соцмережах.',
};

const events: IAboutGroup = {
  title: 'події та семінари',
  banner: eventsBanner,
  text: 'Навчайся у кращих та зростай разом з нами!',
  about: [
    {
      text: 'Відкриті для всіх',
      icon: LuCalendar,
    },
    {
      text: 'Будь-який пояс',
      icon: Belt,
    },
    {
      text: 'Тривалість залежить від заходу',
      icon: LuTimer,
    },
  ],
  goals: [
    'Майстер-класи від топових українських та закордонних інструкторів.',
    'Участь у внутрішніх турнірах клубу та великих чемпіонатах.',
    'Тімбілдінг, обмін досвідом та зміцнення клубної спільноти.',
  ],
  levels: ['Всі рівні'],
};

const pro: IAboutGroup = {
  title: 'про група',
  banner: proBanner,
  text: 'Готові приходити вчасно та регулярно?\nНе пропускати жодної сутички?\nАктивно виступати на змаганнях та допомагати інших у підготовці?\n\nТоді вас вітає Про Група.',
  about: [
    {
      text: 'За запрошенням тренера',
      icon: LuUsers,
    },
    {
      text: 'Всі пояси',
      icon: Belt,
    },
    {
      text: 'Тренування 90 хв',
      icon: LuTimer,
    },
  ],
  goals: [
    'Тренувальний процес на Про групі формується відповідно до потреб атлетів, які готуються на змагання.',
  ],
  requirements: [
    'Тренування для досвідчених спортсменів!',
    'Відвідування за узгодженням з тренером групи.',
  ],
  levels: null,
  levelsDesc:
    'Про група створена для спортсменів що мають рівень, який дозволяє їм брати участь і конкуретно виступати на змаганнях. Якщо ви поки не впевнені у своїх навичках - запрошуємо відвідувати початківців або базову групу',
};

const personal: IAboutGroup = {
  title: 'індивідуальні тренування',
  banner: personalBanner,
  text: 'Максимальний результат у найкоротші терміни',
  about: [
    {
      text: 'Гнучкий графік',
      icon: LuCalendar,
    },
    {
      text: 'Будь-який рівень',
      icon: LuUser,
    },
    {
      text: 'Тренування 60 хв',
      icon: LuTimer,
    },
  ],
  goals: [
    'Персоналізований план навчання, адаптований під ваші цілі та особливості.',
    'Детальне розбирання технічних помилок у реальному часі.',
    'Прискорений прогрес завдяки максимальній увазі тренера.',
  ],
  levels: ['Початковий', 'Середній', 'Просунутий'],
};

export default { kids, basic, beginners, events, pro, personal };
