import { ICoach } from '@/types/coaches';
import testVideo from '@/video/coaches/test.mp4';
import { andrew, buchecha, volodymyr } from './schedule';

const coaches: ICoach[] = [
  {
    name: 'Андрій "Директор"',
    desc: 'Андрій Іщук - тренер з Ноу Гі. Обожнює больові на ноги і не обожнює халати. Методист нашого клубу, який розробив найкращу програму тренування новачків. Готує на змагання під ключ.Родом із майже існуючого Житомира.',
    video: testVideo,
    qualification: 'ЧОРНИЙ ПОЯС',
    experience: '8+ РОКІВ',
    groups: 'НОУ ГІ, ПОЧАТКІВЦІ, БАЗОВА, ПРО',
    id: andrew.id,
  },
  {
    name: 'Володимир "Начальник"',
    desc: 'Володимир Сеньок - фундаменталіст світу Джиу-Джитсу. Володимир має великий досвід у веденні спортсменів, від початківців до регулярно виступаючих спортсменів. Подивився та занотував 200 годин навчальних матеріалів від найкращих тренерів сучасності і не з’їхав з глузду.',
    video: testVideo,
    qualification: 'ЧОРНИЙ ПОЯС',
    experience: '10+ РОКІВ',
    groups: ' ГІ/НОУ-ГІ, ПОЧАТКІВЦІ, БАЗОВА',
    id: volodymyr.id,
  },
  {
    name: 'Бучеча "Шеф"',
    desc: 'Владислав “Бучеча” Шугай - майстер добряк. Може вас провести від позицій для новачків до берімболо з de la riva. Цінує міцний пуер та хороших людей. Родом із ніжного Ніжина.',
    video: testVideo,
    qualification: 'ЧОРНИЙ ПОЯС',
    experience: '10+ РОКІВ',
    groups: 'ГІ, ПОЧАТКІВЦІ, БАЗОВА',
    id: buchecha.id,
  },
];

export default coaches;
