import { ICoach } from '@/types/coaches';
import testVideo from '@/video/coaches/test.mp4';

const coaches: ICoach[] = [
  {
    name: 'Анастасія “Бос”',
    desc: 'Каже, що почала займатись джиу-джитсу, бо хотіла навчитись правильно падати з самоката на Подолі. Тепер навчає інших вставати з посмішкою. Вважає, що головне на тренуванні - знайти нових друзів і трохи попітніти',
    video: testVideo,
    qualification: 'Коричневий пояс',
    experience: '10+ років',
    groups: 'Ноу Гі, Початківці',
  },
  {
    name: 'Сергій “Краб”',
    desc: 'Працює з дорослими групами та ветеранами. Переконаний, що джиу-джитсу відкриває людині її сильні та слабкі сторони та навчає працювати з ними. Улюблений партнер  - це диван після тренування',
    video: testVideo,
    qualification: 'Чорний пояс',
    experience: '8+ років',
    groups: 'Гі, змішана',
  },
  {
    name: 'Андрій “ДЖУС”',
    desc: 'Каже, що почала займатись джиу-джитсу, бо хотіла навчитись правильно падати з самоката на Подолі. Тепер навчає інших вставати з посмішкою. Вважає, що головне на тренуванні - знайти нових друзів і трохи попітніти',
    video: testVideo,
    qualification: 'Коричневий пояс',
    experience: '5+ років',
    groups: 'Гі, Початківці',
  },
];

export default coaches;
