import { IFAQ } from '@/types/faqs';

const faqs: IFAQ[] = [
  {
    question: 'Що потрібно взяти на перше тренування?',
    answer:
      'Легку спортивну форму (футболку, шорти або штани без блискавок), пляшку води та змінне взуття. Якщо у вас є кімоно (гі) — візьміть його, але на перше заняття воно не обов’язкове.',
  },
  {
    question: 'Чи потрібно записуватись заздалегідь?',
    answer:
      'Так, бажано записатись через форму на сайті або телефоном, щоб ми могли підтвердити місце у групі.',
  },
  {
    question: 'Чи підходить тренування для новачків без досвіду?',
    answer:
      'Так! Є спеціальні групи для початківців, де пояснюють усе з нуля — від базових положень до техніки безпеки.',
  },
  {
    question: 'У чому різниця між тренуванням у гі та без гі?',
    answer:
      'У гі тренуються у традиційному кімоно, яке дозволяє брати суперника за одяг. Без гі — у шортах і рашгарді, акцент на утриманнях і хватах за тіло.',
  },
  {
    question: 'Скільки триває тренування?',
    answer:
      'Зазвичай одне заняття триває 60–90 хвилин, залежно від рівня групи.',
  },
  {
    question: 'Як часто варто відвідувати тренування?',
    answer:
      'Оптимально — 2–3 рази на тиждень. Але розклад гнучкий, тому можна обирати під себе',
  },
  {
    question: 'Чи можна прийти просто подивитись?',
    answer:
      'Так, ми відкриті для гостей — можна прийти подивитися на тренування або поспілкуватися з тренером.',
  },
  {
    question: 'Як відбувається оплата тренувань?',
    answer:
      'Є кілька варіантів: разове заняття, абонемент на місяць або індивідуальні тренування. Оплата можлива готівкою або онлайн.',
  },
  {
    question: 'Чи можна тренуватись жінкам?',
    answer:
      'Звичайно! У нас тренуються і жінки, і чоловіки — часто навіть у змішаних групах.',
  },
  {
    question: 'Чи можна приходити після роботи, якщо я запізнююсь на початок?',
    answer:
      'Так, просто попередьте тренера — головне не пропускати розминку, якщо можливо (привіт Андрію).',
  },
  {
    question: 'Чи є пробне тренування?',
    answer: 'Перше тренування оплачується як разове',
  },
  {
    question: 'Чи проводите ви змагання або семінари?',
    answer:
      'Так, клуб регулярно бере участь у турнірах та запрошує інструкторів на майстер-класи.',
  },
];

export default faqs;
